Repository: achappey/aihappey-windows
Catalog: Core/AIHappey.Desktop.Core/Strings/*/Resources.resw
Source language: en
Languages: nl

# ChatForm_openai_realtimeSessionType
source: Session type
nl: Sessietype

# ChatForm_openai_realtimeAudioInputFormat
source: Input audio format
nl: Audio-invoerformaat

# ChatForm_openai_realtimeNoiseReduction
source: Noise reduction
nl: Ruisonderdrukking

# ChatForm_openai_realtimeInputTranscription
source: Input audio transcription
nl: Audio-invoertranscriptie

# ChatForm_openai_realtimeTranscriptionPrompt
source: Transcription prompt
nl: Transcriptieprompt

# ChatForm_openai_realtimeTurnDetection
source: Turn detection
nl: Turn-detectie

# ChatForm_openai_realtimeTurnDetectionType
source: Turn detection type
nl: Type turn-detectie

# ChatForm_openai_realtimeTurnCreateResponse
source: Auto-create response on speech stop
nl: Automatisch response maken bij einde spraak

# ChatForm_openai_realtimeTurnInterruptResponse
source: Interrupt ongoing response on speech start
nl: Lopende response onderbreken bij start spraak

# ChatForm_openai_realtimeVadThreshold
source: VAD threshold (0.0–1.0)
nl: VAD-drempel (0.0–1.0)

# ChatForm_openai_realtimeVadSilenceDurationMs
source: Silence duration (ms)
nl: Stilte-duur (ms)

# ChatForm_openai_realtimeSemanticEagerness
source: Eagerness
nl: Gretigheid

# ChatForm_openai_realtimeIncludeLogprobs
source: Include input transcription logprobs
nl: Logprobs van input-transcriptie opnemen

# ChatForm_openai_realtimeTokenTtlSeconds
source: Token lifetime (seconds)
nl: Levensduur token (seconden)

source: All
nl: Alle

source: Name
nl: Naam

source: Edit
nl: Bewerken

source: Output
nl: Uitvoer

# McpDescription
source: Connect tools and services to your models with Model Context Protocol.
nl: Verbind tools en diensten met je modellen via Model Context Protocol.

# McpAddServer
source: Add server
nl: Server toevoegen

# McpInstalledServers
source: Installed servers
nl: Geïnstalleerde servers

# McpManage
source: Manage
nl: Beheren

# McpInstall
source: Install
nl: Installeren

# McpRemove
source: Uninstall
nl: Verwijderen

# McpSearch
source: Search MCP servers
nl: MCP-servers zoeken

# McpRefresh
source: Refresh MCP registries
nl: MCP-registers vernieuwen

# McpRegistry
source: Registry
nl: Register

# McpRegistryPartialFailure
source: Some registries could not be fully loaded. Available servers are still shown. Retry to refresh.
nl: Sommige registers konden niet volledig worden geladen. Beschikbare servers blijven zichtbaar. Probeer opnieuw om te vernieuwen.

# McpNoRegistries
source: No MCP registries are configured by this app. You can add a Streamable HTTP server manually.
nl: Deze app heeft geen MCP-registers geconfigureerd. Je kunt handmatig een Streamable HTTP-server toevoegen.

# McpNoServers
source: No matching servers found.
nl: Geen overeenkomende servers gevonden.

# McpNoInstalledServers
source: No servers installed. Install from Model Context or add a server URL.
nl: Geen servers geïnstalleerd. Installeer via Model Context of voeg een server-URL toe.

# McpEnableHint
source: Enable trusted servers to make their tools available to model chat. Tools may read or change data using your credentials. Disabling disconnects a server without uninstalling it.
nl: Schakel vertrouwde servers in om hun tools beschikbaar te maken voor modelchat. Tools kunnen met jouw gegevens data lezen of wijzigen. Uitschakelen verbreekt de verbinding zonder de server te verwijderen.

# McpEnabled
source: Enabled
nl: Ingeschakeld

# McpDisabled
source: Disabled
nl: Uitgeschakeld

# McpStateDisabled
source: Disconnected
nl: Niet verbonden

# McpStateConnecting
source: Connecting…
nl: Verbinden…

# McpStateConnected
source: Connected
nl: Verbonden

# McpStateError
source: Connection failed
nl: Verbinding mislukt

# McpDisconnect
source: Disconnect {0}
nl: Verbinding met {0} verbreken

# McpHeadersHint
source: Optional headers are sent only to this MCP server and protected with your Windows account. Gateway credentials are never forwarded. OAuth is not supported in this version.
nl: Optionele headers gaan alleen naar deze MCP-server en worden met je Windows-account beveiligd. Gatewaygegevens worden nooit doorgestuurd. Deze versie ondersteunt geen OAuth.

# McpAddHeader
source: Add header
nl: Header toevoegen

# McpRemoveHeader
source: Remove header
nl: Header verwijderen

# McpHeaderName
source: Header name
nl: Headernaam

# McpHeaderValue
source: Header value
nl: Headerwaarde

# McpInvalidUrl
source: Use an HTTPS URL without credentials, query, or fragment. HTTP is allowed only for loopback servers.
nl: Gebruik een HTTPS-URL zonder aanmeldgegevens, query of fragment. HTTP is alleen toegestaan voor loopbackservers.

# McpInvalidHeaders
source: Check header names and values. Duplicate, control-character, cookie, and SDK-owned transport/session headers are not allowed.
nl: Controleer headernamen en waarden. Dubbele headers, besturingstekens, cookies en transport- of sessieheaders van de SDK zijn niet toegestaan.

# McpInvalidName
source: A server name is required (up to 256 characters).
nl: Een servernaam is verplicht (maximaal 256 tekens).

# McpServerLimit
source: Up to 200 distinct servers can be installed.
nl: Je kunt maximaal 200 verschillende servers installeren.

# McpAuthRequired
source: This server requires authentication. Configure its headers; interactive MCP OAuth is not yet supported.
nl: Deze server vereist authenticatie. Configureer de headers; interactieve MCP-OAuth wordt nog niet ondersteund.

# McpTimedOut
source: The MCP operation was canceled or timed out. A tool call was not retried.
nl: De MCP-bewerking is geannuleerd of heeft een time-out. Een toolaanroep is niet opnieuw geprobeerd.

# McpConnectionFailed
source: The MCP operation failed. Check the server URL, headers, and connection. Tool calls are not retried automatically.
nl: De MCP-bewerking is mislukt. Controleer de server-URL, headers en verbinding. Toolaanroepen worden niet automatisch opnieuw geprobeerd.

# McpDisconnected
source: The MCP server is no longer connected.
nl: De MCP-server is niet meer verbonden.

# McpInvalidArguments
source: MCP tool arguments must be a JSON object.
nl: Argumenten voor een MCP-tool moeten een JSON-object zijn.

# McpUnknownTool
source: This tool is not available in the active MCP context.
nl: Deze tool is niet beschikbaar in de actieve MCP-context.

# McpToolLimit
source: The MCP tool continuation limit was reached. No further tool calls or inference requests were sent.
nl: De limiet voor MCP-toolstappen is bereikt. Er zijn geen verdere toolaanroepen of modelverzoeken verzonden.

# McpResultTooLarge
source: The MCP result exceeds the supported size.
nl: Het MCP-resultaat is groter dan de ondersteunde limiet.

# McpInvalidStoredEntries
source: Some saved MCP entries could not be loaded or decrypted. Add those servers again.
nl: Sommige opgeslagen MCP-servers konden niet worden geladen of ontsleuteld. Voeg die servers opnieuw toe.

# McpReadOnly
source: Read-only
nl: Alleen-lezen

# McpDestructive
source: Destructive
nl: Destructief

# McpOpenWorld
source: Open world
nl: Open wereld

# McpMetadata
source: Metadata
nl: Metagegevens

# McpResources
source: Resources
nl: Bronnen

# McpResourceTemplates
source: Resource templates
nl: Bronsjablonen

# McpVersion
source: Version
nl: Versie

# McpServerProperties
source: Server properties
nl: Servereigenschappen
